In [1]:
import numpy as np
import pandas as pd 
dl={
    'three':[1,2,3,4],
    'four':[5,6,7,8]
}
A=pd.DataFrame(dl,index=['c','b','a','d'])
A

   three  four
c      1     5
b      2     6
a      3     7
d      4     8

In [2]:
A.sort_index()

   three  four
a      3     7
b      2     6
c      1     5
d      4     8

In [3]:
A.sort_index(ascending=False)

   three  four
d      4     8
c      1     5
b      2     6
a      3     7

In [4]:
A.sort_values('three')

   three  four
c      1     5
b      2     6
a      3     7
d      4     8

In [5]:
A['three'].sum()

10

In [6]:
A['four'].mean()

6.5

In [7]:
A['three'].max()

4

In [8]:
A['four'].var()

1.6666666666666667

In [9]:
A.describe()

          three      four
count  4.000000  4.000000
mean   2.500000  6.500000
std    1.290994  1.290994
min    1.000000  5.000000
25%    1.750000  5.750000
50%    2.500000  6.500000
75%    3.250000  7.250000
max    4.000000  8.000000

In [10]:
A.describe().loc['max']

three    4.0
four     8.0
Name: max, dtype: float64